// const ex = {
//     p: '',
//     b1: '',
//     b2: '',
//     b3: '',
//     f1: '',
//     f2: '',
//     f3: '',
// }

const plot = {
  p0: {
    p: "Ты возле завода описание",
    b1: "Поискать залаз",
    b2: "Пойти на КПП",
    b3: "Сделать залаз",
    f1: "p1",
    f2: "p2",
    f3: "p3",
  },

  p2: {
    p: "Ты подошел к КПП. На тебя вышел посмотреть военный(homo-ushtarakus). ",
    b1: "Дать бой",
    b2: "Дать денег",
    b3: "",
    f1: "p21",
    f2: "p22",
    f3: "",
  },

  p21: {
    p: "Ты настроен агрессивно, но пока не подаешь виду.",
    b1: "Использовать перцовый баллон(neuro-parallitic spray)",
    b2: "Использовать кулаки",
    b3: "Использовать разводник",
    f1: "p211",
    f2: "p212",
    f3: "p213",
  },

  p22: {
    p: "Ты протягиваешь воену котлету. Он улыбается и делает пригласительный жест.",
    b1: "Далее",
    b2: "",
    b3: "",
    f1: "p221",
    f2: "",
    f3: "",
  },

  p221: {
    p: "Ты проходишь на завод, начальник охраны угощает тебя suflaqe.",
    b1: "Далее",
    b2: "",
    b3: "",
    f1: "p222",
    f2: "",
    f3: "",
  },

  p222: {
    p: "После вкусного обеда начальник охраны начинает экскурсию. Вы заходите в самый большой цех.",
    b1: "Далее",
    b2: "",
    b3: "",
    f1: "p223",
    f2: "",
    f3: "",
  },

  p223: {
    p: "Ты достаешь фотоаппарат, однако тебе запрещают съемку потому что объект якобы очень секретный. Ты расстраиваешься и приводишь аргумент что завод 100 лет заброшен, проржавел до основания. Начохраны говорит что это он только выглядит заброшенным и на самом деле тут в еще более секретных подземных цехах все еще трудятся рабочие.",
    b1: "Далее",
    b2: "",
    b3: "",
    f1: "p224",
    f2: "",
    f3: "",
  },

  p1: {
    p: "Ты прогулялся вокруг территории и нашел старые ворота. За ними немного кустов ежевики, зато нет колючей проволоки. Ты перелез ограду, прошелся пару сотен метров и залез через выбитое окно в цех.",
    b1: "Далее",
    b2: "",
    b3: "",
    f1: "p222",
    f2: "",
    f3: "",
  },

  p3: {
    p: "Ты сделал залаз на терру точно напротив самого большого цеха, откусив кусачками колючую проволоку. Ты перелез ограду, прошелся пару сотен метров и залез через выбитое окно в цех.",
    b1: "Прогуляться по цеху",
    b2: "Сразу начать фоткать",
    b3: "",
    f1: "p111",
    f2: "p112",
    f3: "",
  },
};
